app/controllers/application_controller.rb

  def complete_auth
    if not params[:frob]
      flash[:error] = "Flickr Authentication wasn't performed correctly"
      redirect_to root_path
      return
    end

    auth = flickr.auth.getToken :frob => params[:frob]
    login = flickr.test.login

    @user.token = auth.token
    @user.save
---
UPDATE `users` SET `updated_at` = '2010-06-24 22:21:43', `token` = '72157624350490572-cbb710a1b25e3812' WHERE `id` = 1